/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Не вдається завершити дію";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Спробуйте ще раз пізніше.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Не вдається відкрити";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "Цей медіаформат не підтримується.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Не вдається відкрити";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "Можливо, цей медіафайл пошкоджений.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Не вдається відкрити";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "Цю програму не авторизовано для відтворення цього файла."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Не вдається відкрити";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "Цей матеріал не можна використати.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Не вдається декодувати";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "Декодер для цього медіавмісту зайнятий.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Зупиніть усі інші дії, які декодують медіавміст, і повторіть спробу.";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_Description" = "Не вдається відкрити";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_FailureReason" = "Цей носій не можна використати на цьому комп’ютері.";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_Description" = "Неможливо відкрити";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_FailureReason" = "Не вдається відтворити вміст на зовнішньому дисплеї.";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_Description" = "Неможливо відкрити";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_FailureReason" = "Захищений вміст не вдасться відтворити за поточної конфігурації системи.";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_Description" = "Вихідна перекодована відеодоріжка містить хибну кількість кадрів";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_FailureReason" = "Кількість перекодованих вихідних кадрів не дорівнює джерелу, у якому відсутні змінні сегменти";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_Description" = "Не вдалося декодувати";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_FailureReason" = "декодер виявив помилку";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_Description" = "Не вдалося закодувати";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_FailureReason" = "кодер виявив помилку";

